clear; clc;
X = [2 8 4; 7 3 9];
A = max(X, [], 1);  %1为列最大值
% A = max(X, 2, 1);  %1为列最大值
B = max(X, [], 2);  %2为行最大值
C = max(X, 5);  %<5取5； >5取原数

An = [76,79,91,0,19,41,1;76,61,93,81,27,46,83;95,7,73,5,19,44,20;95,7,73,89,20,74,52;95,7,40,35,60,93,67;95,45,92,41,13,1,84];
D = sortrows(An, [1 7]);  %对第1列和第7列同时排序

A1 = mean(X, 1);  %1为列平均值
B1 = mean(X, 2);  %2为行平均值

A2 = median(X, 1);  %1为列平均值
B2 = median(X, 2);  %2为行平均值

A3 = std(An, 0, 1);  %计算每列标准差
B3 = std(An, 0, 2);  %计算每行标准差
